In [2]:
import pandas as pd 
import numpy as np

In [3]:
data =pd.read_csv("superstore_dataset.csv")
df=pd.DataFrame(data)
df.head()

,order_id,order_date,ship_date,customer,manufactory,product_name,segment,category,subcategory,region,zip,city,state,country,discount,profit,quantity,sales,profit_margin
0,US-2020-103800,1/3/2019,1/7/2019,Darren Powers,Message Book,"Message Book, Wirebound, Four 5 1/2"" X 4"" Form...",Consumer,Office Supplies,Paper,Central,77095,Houston,Texas,United States,0.2,5.5512,2,16.448,0.3375
1,US-2020-112326,1/4/2019,1/8/2019,Phillina Ober,GBC,GBC Standard Plastic Binding Systems Combs,Home Office,Office Supplies,Binders,Central,60540,Naperville,Illinois,United States,0.8,-5.4870,2,3.540,-1.5500
2,US-2020-112326,1/4/2019,1/8/2019,Phillina Ober,Avery,Avery 508,Home Office,Office Supplies,Labels,Central,60540,Naperville,Illinois,United States,0.2,4.2717,3,11.784,0.3625
3,US-2020-112326,1/4/2019,1/8/2019,Phillina Ober,SAFCO,SAFCO Boltless Steel Shelving,Home Office,Office Supplies,Storage,Central,60540,Naperville,Illinois,United States,0.2,-64.7748,3,272.736,-0.2375
4,US-2020-141817,1/5/2019,1/12/2019,Mick Brown,Avery,Avery Hi-Liter EverBold Pen Style Fluorescent ...,Consumer,Office Supplies,Art,East,19143,Philadelphia,Pennsylvania,United States,0.2,4.8840,3,19.536,0.2500

In [4]:
# construire region_id et le merger
df["region"] = (
    df["region"]
    .str.strip()
    .str.lower()
)

df_region = (
    df[["region"]]
    .drop_duplicates()
    .reset_index(drop=True)
)

df_region["region_id"] = df_region.index + 1
df = df.merge(df_region, on="region", how="left")

In [5]:
#construire product_id
df["product_name"] = (
    df["product_name"]
    .str.strip()
    .str.lower()
)
df_product = (
    df[["product_name"]]
    .drop_duplicates()
    .reset_index(drop=True)
)

df_product["product_id"] = df_product.index + 1
df = df.merge(df_product, on="product_name", how="left")

In [6]:
#construire category_id
df["category"] = (
    df["category"]
    .str.strip()
    .str.lower()
)
df_category = (
    df[["category"]]
    .drop_duplicates()
    .reset_index(drop=True)
)

df_category["category_id"] = df_category.index + 1
df = df.merge(df_category, on="category", how="left")

In [6]:
# construire subcategorY_id
df["subcategory"] = (
    df["subcategory"]
    .str.strip()
    .str.lower()
)
df_subcategory = (
    df[["subcategory"]]
    .drop_duplicates()
    .reset_index(drop=True)
)

df_subcategory["subcategory_id"] = df_subcategory.index + 1
df = df.merge(df_subcategory, on="subcategory", how="left")

In [7]:
#construire country_id
df["country"] = (
    df["country"]
    .str.strip()
    .str.lower()
)
df_country = (
    df[["country"]]
    .drop_duplicates()
    .reset_index(drop=True)
)

df_country["country_id"] = df_country.index + 1
df = df.merge(df_country, on="country", how="left")

In [8]:
df["manufactory"] = (
    df["manufactory"]
    .str.strip()
    .str.lower()
)
df_manufactory = (
    df[["manufactory"]]
    .drop_duplicates()
    .reset_index(drop=True)
)

df_manufactory["manufactory_id"] = df_manufactory.index + 1
df = df.merge(df_manufactory, on="manufactory", how="left")

In [38]:
df["state"] = (
    df["state"]
    .str.strip()
    .str.lower()
)
df_state = (
    df[["state"]]
    .drop_duplicates()
    .reset_index(drop=True)
)

df_state["state_id"] = df_state.index + 1
df = df.merge(df_state, on="state", how="left")

In [10]:
df["store_id"] = (
    df["city"]
    .astype("category")
    .cat.codes + 1
)

In [11]:
df.head()

,order_id,order_date,ship_date,customer,manufactory,product_name,segment,category,subcategory,region,...,sales,profit_margin,region_id,product_id,category_id,subcategory_id,country_id,manufactory_id,state_id,store_id
0,US-2020-103800,1/3/2019,1/7/2019,Darren Powers,message book,"message book, wirebound, four 5 1/2"" x 4"" form...",Consumer,office supplies,paper,central,...,16.448,0.3375,1,1,1,1,1,1,1,208
1,US-2020-112326,1/4/2019,1/8/2019,Phillina Ober,gbc,gbc standard plastic binding systems combs,Home Office,office supplies,binders,central,...,3.540,-1.5500,1,2,1,2,1,2,2,322
2,US-2020-112326,1/4/2019,1/8/2019,Phillina Ober,avery,avery 508,Home Office,office supplies,labels,central,...,11.784,0.3625,1,3,1,3,1,3,2,322
3,US-2020-112326,1/4/2019,1/8/2019,Phillina Ober,safco,safco boltless steel shelving,Home Office,office supplies,storage,central,...,272.736,-0.2375,1,4,1,4,1,4,2,322
4,US-2020-141817,1/5/2019,1/12/2019,Mick Brown,avery,avery hi-liter everbold pen style fluorescent ...,Consumer,office supplies,art,east,...,19.536,0.2500,2,5,1,5,1,3,3,375

In [12]:
orders_unique = (
    df[["order_id", "zip"]]
    .drop_duplicates()
    .sort_values(["zip", "order_id"])
    .reset_index(drop=True)
)
orders_unique["zip_index"] = (
    orders_unique["zip"]
    .astype("category")
    .cat.codes
)
NB_CAISSIERS_PAR_ZIP = 2

orders_unique["caissier_id"] = (
    orders_unique.groupby("zip")
    .cumcount() % NB_CAISSIERS_PAR_ZIP
) + 1 + orders_unique["zip_index"] * NB_CAISSIERS_PAR_ZIP
df = df.merge(
    orders_unique[["order_id", "caissier_id"]],
    on="order_id",
    how="left"
)
df.head()

,order_id,order_date,ship_date,customer,manufactory,product_name,segment,category,subcategory,region,...,profit_margin,region_id,product_id,category_id,subcategory_id,country_id,manufactory_id,state_id,store_id,caissier_id
0,US-2020-103800,1/3/2019,1/7/2019,Darren Powers,message book,"message book, wirebound, four 5 1/2"" x 4"" form...",Consumer,office supplies,paper,central,...,0.3375,1,1,1,1,1,1,1,208,851
1,US-2020-112326,1/4/2019,1/8/2019,Phillina Ober,gbc,gbc standard plastic binding systems combs,Home Office,office supplies,binders,central,...,-1.5500,1,2,1,2,1,2,2,322,689
2,US-2020-112326,1/4/2019,1/8/2019,Phillina Ober,avery,avery 508,Home Office,office supplies,labels,central,...,0.3625,1,3,1,3,1,3,2,322,689
3,US-2020-112326,1/4/2019,1/8/2019,Phillina Ober,safco,safco boltless steel shelving,Home Office,office supplies,storage,central,...,-0.2375,1,4,1,4,1,4,2,322,689
4,US-2020-141817,1/5/2019,1/12/2019,Mick Brown,avery,avery hi-liter everbold pen style fluorescent ...,Consumer,office supplies,art,east,...,0.2500,2,5,1,5,1,3,3,375,165

In [21]:
orders_df=df[["order_id","order_date","ship_date","caissier_id"]]
orders_df["order_id"] = orders_df["order_id"].str.slice(start=8)
orders_df=orders_df.rename(columns={"caissier_id":"user_id"})
orders_df=orders_df.drop_duplicates()
orders_df.head()

C:\Users\EL ARBANI\AppData\Local\Temp\ipykernel_5276\2100976253.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  orders_df["order_id"] = orders_df["order_id"].str.slice(start=8)

  order_id order_date  ship_date  user_id
0   103800   1/3/2019   1/7/2019      851
1   112326   1/4/2019   1/8/2019      689
4   141817   1/5/2019  1/12/2019      165
5   106054   1/6/2019   1/7/2019      283
6   130813   1/6/2019   1/8/2019     1039

In [23]:
products_df=df[["product_id","product_name","subcategory_id"]]
products_df=products_df.drop_duplicates(subset=['product_name'])
products_df.head()

,product_id,product_name,subcategory_id
0,1,"message book, wirebound, four 5 1/2"" x 4"" form...",1
1,2,gbc standard plastic binding systems combs,2
2,3,avery 508,3
3,4,safco boltless steel shelving,4
4,5,avery hi-liter everbold pen style fluorescent ...,5

In [24]:
len(products_df)

1849

In [39]:
city_df=df[["zip","city","state_id"]]
city_df= (
    city_df
    .groupby("city", as_index=False)
    .agg({
        "zip": lambda x: x.mode().iloc[0]
    })
)

city_ids=city_df["zip"]

df_state = (
    df[df["zip"].isin(city_ids)]
    [["zip", "state_id"]]
    .drop_duplicates()
)

city_df = city_df.merge(
    df_state,
    left_on="zip",  # zip dans city_df
    right_on="zip",     # zip dans df
    how="left"
)

city_df=city_df.rename(columns={"zip":"city_id"})

In [40]:
city_df.head()

          city  city_id  state_id
0     Aberdeen    57401        20
1      Abilene    79605         1
2        Akron    44312        10
3  Albuquerque    87105        31
4   Alexandria    22304         7

In [7]:
category_df=df[["category_id","category"]]
category_df=category_df.rename(columns={"category":"category_name"})
category_df=category_df.drop_duplicates(subset=["category_name"])
category_df.head()

    category_id    category_name
0             1  office supplies
7             2        furniture
12            3       technology

In [31]:
region_df=df[["region_id","region"]]
region_df=region_df.rename(columns={"region":"name"})
region_df=region_df.drop_duplicates(subset=["name"])
region_df.head()

   region_id     name
0          1  central
4          2     east
5          3    south
6          4     west

In [77]:
state_df=df[["state_id","state","region_id"]]
state_df=state_df.rename(columns={"state":"name"})
state_df=state_df.drop_duplicates(subset=["name"])
state_df.head()

   state_id          name  region_id
0         1         texas          1
1         2      illinois          1
4         3  pennsylvania          2
5         4       georgia          3
6         5    california          4

In [ ]:
subcategory_df=df[["subcategory_id","subcategory","category_id"]]
subcategory_df=subcategory_df.drop_duplicates(subset=["subcategory"])
subcategory_df.head()

     subcategory_id subcategory  category_id
38               13  appliances            1
72               14      tables            2
107              15    supplies            1
182              16    machines            3
418              17     copiers            3

In [37]:

import pandas as pd
from faker import Faker
import random
valeurs=df["caissier_id"].unique().tolist()
fake = Faker()
n = 2000

ids = []
names = []
emails = []
passwords = []
dates_of_birth = []

for i in range(1, n+1):
    ids.append(i)
    name = fake.name().replace(" ", "").lower()  # supprime les espaces et met en minuscule
    names.append(name)
    emails.append(f"{name}{i}@gmail.com")  # email = nom@gmail.com
    passwords.append("javajee123")  # mot de passe unique
    dates_of_birth.append(fake.date_of_birth(minimum_age=18, maximum_age=70))

users_df = pd.DataFrame({
    'ID': ids,
    'user_name': names,
    'mail': emails,
    'password': passwords,
    'dateOfBirth': dates_of_birth
})
users_df.head()

   ID        user_name                        mail    password dateOfBirth
0   1     zacharyhicks     zacharyhicks1@gmail.com  javajee123  1989-05-18
1   2  kimberlyhoffman  kimberlyhoffman2@gmail.com  javajee123  2004-11-12
2   3     andrewmiller     andrewmiller3@gmail.com  javajee123  1976-10-21
3   4     charlesburns     charlesburns4@gmail.com  javajee123  1963-09-28
4   5       jennayoung       jennayoung5@gmail.com  javajee123  1957-09-19

In [78]:
len(users_df)

2000

In [39]:
caissier_df= pd.DataFrame(users_df[users_df['ID'].isin(valeurs)])
len(caissier_df)

1119

In [ ]:
from faker import Faker
from datetime import datetime,date
caissier_df=caissier_df.drop(["dateOfBirth","user_name","mail","password"],axis=1)
n = len(caissier_df)
fake=Faker()
start = date(2010, 1, 1)
end = date.today()
# 1️⃣ Ajouter date_started aléatoire entre 2010 et aujourd'hui
caissier_df['date_started'] = [fake.date_between(start_date=start, end_date=end) for _ in range(n)]

# 2️⃣ Ajouter salaire proportionnel à l'ancienneté
today = datetime.today()
caissier_df['salary'] = 2000 + 100 * caissier_df['date_started'].apply(lambda x: today.year - x.year)

In [41]:
caissier_df.head()

   ID date_started  salary
0   1   2019-10-10    2600
2   3   2018-06-01    2700
3   4   2014-09-26    3100
4   5   2017-08-26    2800
6   7   2021-11-06    2400

In [42]:
# IDs déjà utilisés dans caissier_df
ids_caissier = set(caissier_df['ID'])

# Filtrer pour garder uniquement les IDs non utilisés
df_disponible = users_df[~users_df['ID'].isin(ids_caissier)]

# Sélectionner aléatoirement 531 personnes
admin_store_df = df_disponible.sample(n=531, random_state=42)  # random_state pour reproductibilité

admin_store_df=admin_store_df.drop(["user_name","mail","password","dateOfBirth"],axis=1)

In [216]:
state_df.head(23)

    state_id            name  region_id
0          1           texas          1
1          2        illinois          1
4          3    pennsylvania          2
5          4         georgia          3
6          5      california          4
7          6        kentucky          3
18         7        virginia          3
20         8        delaware          2
21         9  south carolina          3
22        10            ohio          2
27        11       louisiana          3
38        12          oregon          4
39        13         arizona          4
43        14        arkansas          3
49        15       tennessee          3
52        16        michigan          1
60        17         florida          3
61        18          nevada          4
62        19         indiana          1
70        20    south dakota          1
75        21        new york          2
79        22       wisconsin          1
83        23      washington          4

In [79]:
admin_store_df.head()

        ID date_started  salary  store_id
1469  1470   2019-02-17   10600       208
1373  1374   2011-10-25   11400       322
1609  1610   2010-12-07   11500       375
1807  1808   2018-09-11   10700        21
1512  1513   2019-01-20   10600       267

In [81]:
from faker import Faker
from datetime import datetime,date
n = len(admin_store_df)
fake=Faker()
start = date(2010, 1, 1)
end = date.today()
# Ajouter date_started aléatoire entre 2010 et aujourd'hui
admin_store_df['date_started'] = [fake.date_between(start_date=start, end_date=end) for _ in range(n)]

# Ajouter salaire proportionnel à l'ancienneté
today = datetime.today()
admin_store_df['salary'] = 10000 + 100 * admin_store_df['date_started'].apply(lambda x: today.year - x.year)

In [82]:
admin_store_df.head()

        ID date_started  salary  store_id
1469  1470   2018-07-17   10700       208
1373  1374   2019-07-06   10600       322
1609  1610   2019-08-15   10600       375
1807  1808   2024-12-25   10100        21
1512  1513   2025-11-16   10000       267

In [83]:
# Récupérer tous les IDs déjà utilisés
ids_utilises = set(caissier_df['ID']).union(set(admin_store_df['ID']))

# Filtrer pour garder uniquement les IDs non utilisés
df_disponible = users_df[~users_df['ID'].isin(ids_utilises)]

# Sélectionner aléatoirement 182 personnes
investor_df = df_disponible.sample(n=182, random_state=42)  # random_state pour reproductibilité
investor_df=investor_df.drop(["user_name","mail","password","dateOfBirth"],axis=1)

In [84]:
investor_df.head()

        ID
1546  1547
1973  1974
1913  1914
1746  1747
1538  1539

In [47]:
ids_utilises1 = set(caissier_df['ID']).union(set(admin_store_df['ID'])).union(set(investor_df))

# Filtrer pour garder uniquement les IDs non utilisés
df_disponible = users_df[~users_df['ID'].isin(ids_utilises1)]

# Sélectionner aléatoirement 182 personnes
adminG_df = df_disponible.sample(n=1, random_state=42)  # random_state pour reproductibilité
adminG_df=adminG_df.drop(["user_name","mail","password","dateOfBirth"],axis=1)

In [48]:
adminG_df.head()

        ID
1546  1547

In [92]:
import numpy as np
inventory = df[["store_id","product_id"]].copy()
inventory["quantity"]= (np.random.beta(a=0.5, b=4, size=len(df)) * 210).astype(int)
inventory["inventory_id"]=range(1,len(inventory)+1)
inventory.head()

   store_id  product_id  quantity  inventory_id
0       208           1         3             1
1       322           2         9             2
2       322           3         2             3
3       322           4        17             4
4       375           5         0             5

In [99]:
orderItems = (
    df[["order_id", "product_id", "sales", "quantity", "discount"]]
    .reset_index(drop=True)
)
orderItems["item_id"] = orderItems.index + 1
orderItems=orderItems.rename(columns={"sales":"price"})
orderItems["order_id"] = orderItems["order_id"].str.slice(start=8)

print(orderItems.head())

  order_id  product_id    price  quantity  discount  item_id
0   103800           1   16.448         2       0.2        1
1   112326           2    3.540         2       0.8        2
2   112326           3   11.784         3       0.2        3
3   112326           4  272.736         3       0.2        4
4   141817           5   19.536         3       0.2        5

In [100]:
inventory.head()

   store_id  product_id  quantity  inventory_id
0       208           1         3             1
1       322           2         9             2
2       322           3         2             3
3       322           4        17             4
4       375           5         0             5

In [97]:
import pandas as pd

# 1. Créer la grille de toutes les combinaisons possibles
all_stores = inventory['store_id'].unique()
all_products = inventory['product_id'].unique()
grid = pd.MultiIndex.from_product([all_stores, all_products], names=['store_id', 'product_id']).to_frame(index=False)

# 2. Fusionner la grille avec votre inventaire actuel
# On utilise 'left' pour garder TOUTES les combinaisons de la grille
df_complete = pd.merge(grid, inventory.drop(columns=['inventory_id']), on=['store_id', 'product_id'], how='left')

# 3. Remplir les quantités vides par 0
df_complete['quantity'] = df_complete['quantity'].fillna(0).astype(int)

# 4. Gérer l'inventory_id (Re-générer une suite propre de 1 à N)
df_complete = df_complete.reset_index(drop=True)
df_complete['id'] = df_complete.index + 1

# 5. Réorganiser les colonnes pour correspondre à votre table SQL
df_complete = df_complete[['id', 'store_id', 'product_id', 'quantity']]
len(df_complete)

982526

In [ ]:
i.head()

    category_id    category_name
0             1  office supplies
7             2        furniture
12            3       technology

In [41]:
n = len(city_df)

# Générer store_id
store_ids = [f"{i+1}" for i in range(n)]
store_ids=df["store_id"].unique().tolist()
# Utiliser les IDs des villes
city_ids = city_df['city_id'].unique().tolist()

# Créer la DataFrame store_df
store_df = pd.DataFrame({
    'store_id': store_ids,
    'city_id': city_ids
})

KeyError: 'store_id'

In [51]:
store_df.head()

   store_id  city_id
0       208    57401
1       322    79605
2       375    44312
3        21    87105
4       267    22304

In [52]:
city_df = city_df.drop_duplicates(subset=['city'], keep='first').reset_index(drop=True)
city_df=city_df.rename(columns={"zip":"city_id","city":"city_name"})

In [54]:
city_df.head()

     city_name  city_id
0     Aberdeen    57401
1      Abilene    79605
2        Akron    44312
3  Albuquerque    87105
4   Alexandria    22304

In [55]:
orderItems = (
    df[["order_id", "product_id", "sales", "quantity", "discount"]]
    .reset_index(drop=True)
)
orderItems["item_id"] = orderItems.index + 1
orderItems=orderItems.rename(columns={"sales":"price"})
orderItems.head()

         order_id  product_id    price  quantity  discount  item_id
0  US-2020-103800           1   16.448         2       0.2        1
1  US-2020-112326           2    3.540         2       0.8        2
2  US-2020-112326           3   11.784         3       0.2        3
3  US-2020-112326           4  272.736         3       0.2        4
4  US-2020-141817           5   19.536         3       0.2        5

In [56]:
inventory = df[["store_id","product_id"]].copy()
inventory["quantity"]= (np.random.beta(a=0.5, b=4, size=len(df)) * 210).astype(int)
inventory["inventory_id"]=range(1,len(inventory)+1)
inventory.head()

   store_id  product_id  quantity  inventory_id
0       208           1         1             1
1       322           2         0             2
2       322           3         0             3
3       322           4         0             4
4       375           5        78             5

In [105]:
len(store_df)

531

In [57]:
subcategory_df=subcategory_df.rename(columns={"subcategory":"subcategory_name"})

In [59]:
admin_store_df["store_id"]=store_df["store_id"].values
admin_store_df.head()

        ID date_started  salary  store_id
1469  1470   2019-02-17   10600       208
1373  1374   2011-10-25   11400       322
1609  1610   2010-12-07   11500       375
1807  1808   2018-09-11   10700        21
1512  1513   2019-01-20   10600       267

In [134]:
df_store = df[["caissier_id", "store_id"]].drop_duplicates()
df_store=df_store.rename(columns={"caissier_id":"ID"})

In [128]:
store_df.head()

   store_id  city_id
0       208    57401
1       322    79605
2       375    44312
3        21    87105
4       267    22304

In [130]:
df_store = df[["caissier_id", "store_id"]].drop_duplicates()
len(df_store)

1120

In [140]:
city_df.head()

          city  city_id  state_id
0     Aberdeen    57401        20
1      Abilene    79605         1
2        Akron    44312        10
3  Albuquerque    87105        31
4   Alexandria    22304         7

In [142]:
users_df.head()

   ID        user_name                        mail    password dateOfBirth
0   1     zacharyhicks     zacharyhicks1@gmail.com  javajee123  1989-05-18
1   2  kimberlyhoffman  kimberlyhoffman2@gmail.com  javajee123  2004-11-12
2   3     andrewmiller     andrewmiller3@gmail.com  javajee123  1976-10-21
3   4     charlesburns     charlesburns4@gmail.com  javajee123  1963-09-28
4   5       jennayoung       jennayoung5@gmail.com  javajee123  1957-09-19

In [126]:
city_df.columns

Index(['city', 'city_id', 'state_id'], dtype='object')

In [54]:
investor_df.columns

NameError: name 'investor_df' is not defined

In [ ]:
store_df = pd.merge(
    store_df, 
    city_df[['colonne_commune', 'colonne_a_extraire']], 
    on='colonne_commune', 
    how='left'
)

In [145]:
mask = users_df["ID"].isin(investor_df["ID"])
users_df.loc[mask, "user_name"] = np.random.choice(
    df["manufactory"].unique(),
    size=mask.sum(),
    replace=True
)
users_investors_df = users_df.merge(
    investor_df,
    left_on="ID",
    right_on="ID",
    how="inner"
)
users_df["mail"] = (
    users_df["user_name"]
    .str.lower()
    .str.replace(" ", "", regex=False)
    + (users_df.index + 1).astype(str)
    + "@gmail.com"
)

In [66]:

caissier_df = caissier_df.merge(
    df_store,
    on="ID",
    how="left"
)

In [67]:
caissier_df.head()

   ID date_started  salary  store_id
0   1   2019-10-10    2600       204
1   3   2018-06-01    2700       254
2   4   2014-09-26    3100       254
3   5   2017-08-26    2800       283
4   7   2021-11-06    2400        11

In [203]:
caissier_df.head()

   ID date_started  salaire  store_id
0   1   2019-10-10     2600       204
1   3   2018-06-01     2700       254
2   4   2014-09-26     3100       254
3   5   2017-08-26     2800       283
4   7   2021-11-06     2400        11

In [167]:
users_df=users_df.rename(columns={"ID":"id","dateOfBirth":"date_of_birth"})

In [150]:
caissier_df=caissier_df.rename(columns={"salary":"salaire"})

In [204]:
caissier_df=caissier_df.drop_duplicates(subset=["ID"])

In [154]:
city_df=city_df.rename(columns={"city":"city_name"})

In [169]:
from sqlalchemy import create_engine
engine = create_engine(
    'postgresql+psycopg2://postgres:Admin@localhost:5432/analify'
)

In [174]:
users_df.to_sql(
    "user",          # nom de la table PostgreSQL
    engine,
    if_exists="append", # append → ajoute les lignes à la table
    index=False        # ne pas écrire l'index de pandas comme colonne
)

1000

In [229]:
subcategory_df.to_sql(
    "subcategory",          # nom de la table PostgreSQL
    engine,
    if_exists="append", # append → ajoute les lignes à la table
    index=False        # ne pas écrire l'index de pandas comme colonne
)

17

In [223]:
store_df.to_sql(
    "store",          # nom de la table PostgreSQL
    engine,
    if_exists="append", # append → ajoute les lignes à la table
    index=False        # ne pas écrire l'index de pandas comme colonne
)

531

In [217]:
state_df.to_sql(
    "state",          # nom de la table PostgreSQL
    engine,
    if_exists="append", # append → ajoute les lignes à la table
    index=False        # ne pas écrire l'index de pandas comme colonne
)

49

In [187]:
region_df.to_sql(
    "region",          # nom de la table PostgreSQL
    engine,
    if_exists="append", # append → ajoute les lignes à la table
    index=False        # ne pas écrire l'index de pandas comme colonne
)

IntegrityError: (psycopg2.errors.UniqueViolation) ERREUR:  la valeur d'une clé dupliquée rompt la contrainte unique « region_pkey »
DETAIL:  La clé « (region_id)=(1) » existe déjà.

[SQL: INSERT INTO region (region_id, name) VALUES (%(region_id__0)s, %(name__0)s), (%(region_id__1)s, %(name__1)s), (%(region_id__2)s, %(name__2)s), (%(region_id__3)s, %(name__3)s)]
[parameters: {'name__0': 'central', 'region_id__0': 1, 'name__1': 'east', 'region_id__1': 2, 'name__2': 'south', 'region_id__2': 3, 'name__3': 'west', 'region_id__3': 4}]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

In [ ]:
# 1. Récupérer la liste des IDs des investisseurs
investisseur_ids = investor_df['ID'].values

# 2. Créer la nouvelle colonne dans products_df
# On pioche au hasard parmi les IDs pour chaque ligne de products_df
products_df['ID_investisseur'] = np.random.choice(investisseur_ids, size=len(products_df))

# Affichage pour vérifier
products_df.head()

In [246]:
products_df.to_sql(
    "product",          # nom de la table PostgreSQL
    engine,
    if_exists="append", # append → ajoute les lignes à la table
    index=False        # ne pas écrire l'index de pandas comme colonne
)

849

In [191]:
orders_df['order_date'] = pd.to_datetime(orders_df['order_date'])
orders_df['ship_date'] = pd.to_datetime(orders_df['ship_date'])

In [225]:
orders_df.to_sql(
    "orders",          # nom de la table PostgreSQL
    engine,
    if_exists="append", # append → ajoute les lignes à la table
    index=False        # ne pas écrire l'index de pandas comme colonne
)

9

In [224]:
caissier_df.to_sql(
    "caissier",          # nom de la table PostgreSQL
    engine,
    if_exists="append", # append → ajoute les lignes à la table
    index=False        # ne pas écrire l'index de pandas comme colonne
)

119

In [247]:
orderItems.to_sql(
    "order_items",          # nom de la table PostgreSQL
    engine,
    if_exists="append", # append → ajoute les lignes à la table
    index=False        # ne pas écrire l'index de pandas comme colonne
)

994

In [211]:
investor_df.to_sql(
    "investor",          # nom de la table PostgreSQL
    engine,
    if_exists="append", # append → ajoute les lignes à la table
    index=False        # ne pas écrire l'index de pandas comme colonne
)

182

In [248]:
df_complete.to_sql(
    "inventory",          # nom de la table PostgreSQL
    engine,
    if_exists="append", # append → ajoute les lignes à la table
    index=False        # ne pas écrire l'index de pandas comme colonne
)

526

In [218]:
city_df.to_sql(
    "city",          # nom de la table PostgreSQL
    engine,
    if_exists="append", # append → ajoute les lignes à la table
    index=False        # ne pas écrire l'index de pandas comme colonne
)

531

In [220]:
category_df.to_sql(
    "category",          # nom de la table PostgreSQL
    engine,
    if_exists="append", # append → ajoute les lignes à la table
    index=False        # ne pas écrire l'index de pandas comme colonne
)

3

In [234]:
adminG_df.to_sql(
    "adming",          # nom de la table PostgreSQL
    engine,
    if_exists="append", # append → ajoute les lignes à la table
    index=False        # ne pas écrire l'index de pandas comme colonne
)

1

In [236]:
admin_store_df.to_sql(
    "admin_store",          # nom de la table PostgreSQL
    engine,
    if_exists="append", # append → ajoute les lignes à la table
    index=False        # ne pas écrire l'index de pandas comme colonne
)

531

In [242]:
len(products_df["ID_investisseur"])

1849

In [244]:
products_df=products_df.rename(columns={"ID_investisseur":"id_inv"})

In [249]:
products_df.head()

,product_id,product_name,subcategory_id,id_inv
0,1,"message book, wirebound, four 5 1/2"" x 4"" form...",1,1644
1,2,gbc standard plastic binding systems combs,2,1417
2,3,avery 508,3,1779
3,4,safco boltless steel shelving,4,1421
4,5,avery hi-liter everbold pen style fluorescent ...,5,1974

In [250]:
temp_product=df[["product_name","sales"]]

In [258]:
temp_product=temp_product.drop_duplicates(subset=["product_name"])

In [259]:
temp_product = temp_product[temp_product['product_name'].isin(products_df['product_name'])]

In [260]:
len(temp_product)

1849

In [ ]:
len(city_df["name"].unique())

NameError: name 'city_df' is not defined

In [262]:
temp_product=temp_product.rename(columns={"sales":"price"})

In [263]:
temp_product.head()

                                        product_name    price
0  message book, wirebound, four 5 1/2" x 4" form...   16.448
1         gbc standard plastic binding systems combs    3.540
2                                          avery 508   11.784
3                      safco boltless steel shelving  272.736
4  avery hi-liter everbold pen style fluorescent ...   19.536

In [264]:
temp_product.to_sql(
    "temp_prices",          # nom de la table PostgreSQL
    engine,
    if_exists="append", # append → ajoute les lignes à la table
    index=False        # ne pas écrire l'index de pandas comme colonne
)

849

In [26]:
category_df.head()

    category_id    category_name
0             1  office supplies
7             2        furniture
12            3       technology

In [9]:
len(category_df["category_name"].unique())

3

In [27]:
import pandas as pd

# Nombre de rangs (ex: 9 rangs = 3 catégories)
n_rangs = 9

rang_ids = []
rang_names = []
descriptions = []
category_ids = []

for rang_id in range(1, n_rangs + 1):
    # Chaque 3 rangs → même category_id
    category_id = ((rang_id - 1) // 3) + 1

    rang_ids.append(rang_id)
    rang_names.append(f"rang_{rang_id}")
    descriptions.append(
        f"This rank represents position level {rang_id} within the system hierarchy."
    )
    category_ids.append(category_id)

rang_df = pd.DataFrame({
    "rang_id": rang_ids,
    "rang_name": rang_names,
    "description": descriptions,
    "category_id": category_ids
})

rang_df.head()

,rang_id,rang_name,description,category_id
0,1,rang_1,This rank represents position level 1 within t...,1
1,2,rang_2,This rank represents position level 2 within t...,1
2,3,rang_3,This rank represents position level 3 within t...,1
3,4,rang_4,This rank represents position level 4 within t...,2
4,5,rang_5,This rank represents position level 5 within t...,2

In [45]:
rang_df.head()

,rang_id,rang_name,description,category_id
0,1,rang_1,This rank represents position level 1 within t...,1
1,2,rang_2,This rank represents position level 2 within t...,1
2,3,rang_3,This rank represents position level 3 within t...,1
3,4,rang_4,This rank represents position level 4 within t...,2
4,5,rang_5,This rank represents position level 5 within t...,2

In [28]:
import pandas as pd

# Nombre total de faces
n_faces = 18

# Génération des données
face_ids = list(range(1, n_faces + 1))
face_names = [f"face_{i}" for i in face_ids]
rang_ids=[]

descriptions = []
for face_id in face_ids:
    rang_id = (face_id + 1) // 2  # chaque 2 faces → même rang
    descriptions.append(
        f"face {face_id} of the rang {rang_id}."
    )
    rang_ids.append(rang_id)

data = {
    "face_id": face_ids,
    "face_name": face_names,
    "description": descriptions,
    "rang_id":rang_ids
}

# Création du DataFrame
face_df = pd.DataFrame(data)

# Affichage
face_df.head()

   face_id face_name            description  rang_id
0        1    face_1  face 1 of the rang 1.        1
1        2    face_2  face 2 of the rang 1.        1
2        3    face_3  face 3 of the rang 2.        2
3        4    face_4  face 4 of the rang 2.        2
4        5    face_5  face 5 of the rang 3.        3

In [51]:
import pandas as pd
import random
from datetime import date, timedelta

# Paramètres
n_faces = 18
sections_per_face = 20
date_delai_value = date.today() + timedelta(days=30)

section_ids = []
section_names = []
face_ids = []
descriptions = []
base_prices = []
current_prices = []
statuses = []
date_delais = []

section_id = 1

for face_id in range(1, n_faces + 1):
    rang_id = (face_id + 1) // 2  # 2 faces par rang

    for position in range(1, sections_per_face + 1):
        # Prix multiple de 100 entre 2000 et 6000
        price = random.randrange(2000, 6001, 100)

        section_ids.append(section_id)
        section_names.append(f"section_{section_id}")
        face_ids.append(face_id)

        descriptions.append(
            f"Section {section_id} located on face_{face_id} of rang_{rang_id}, "
            f"position {position}."
        )

        base_prices.append(price)
        current_prices.append(price)  # égalité garantie
        statuses.append("CLOSE")
        date_delais.append(date_delai_value)

        section_id += 1

# Création du DataFrame
section_df = pd.DataFrame({
    "section_id": section_ids,
    "section_name": section_names,
    "face_id": face_ids,
    "description": descriptions,
    "base_price": base_prices,
    "current_price": current_prices,
    "date_delai": date_delais,
    "status": statuses
})

# Vérifications
section_df.head()

,section_id,section_name,face_id,description,base_price,current_price,date_delai,status
0,1,section_1,1,"Section 1 located on face_1 of rang_1, positio...",2400,2400,2026-01-31,CLOSE
1,2,section_2,1,"Section 2 located on face_1 of rang_1, positio...",4500,4500,2026-01-31,CLOSE
2,3,section_3,1,"Section 3 located on face_1 of rang_1, positio...",3900,3900,2026-01-31,CLOSE
3,4,section_4,1,"Section 4 located on face_1 of rang_1, positio...",3500,3500,2026-01-31,CLOSE
4,5,section_5,1,"Section 5 located on face_1 of rang_1, positio...",2100,2100,2026-01-31,CLOSE

In [52]:
len(section_df)

360

In [35]:
section_df.head()

,store_id,section_id,section_name,face_id,description,base_price,current_price,date_delai,status
0,1,1,mag_1_sec_1,1,"Magasin 1, Face 1, Position 1",5800,5800,2026-01-31,CLOSE
1,1,2,mag_1_sec_2,1,"Magasin 1, Face 1, Position 2",2700,2700,2026-01-31,CLOSE
2,1,3,mag_1_sec_3,1,"Magasin 1, Face 1, Position 3",2700,2700,2026-01-31,CLOSE
3,1,4,mag_1_sec_4,1,"Magasin 1, Face 1, Position 4",5800,5800,2026-01-31,CLOSE
4,1,5,mag_1_sec_5,1,"Magasin 1, Face 1, Position 5",5600,5600,2026-01-31,CLOSE

In [34]:
section_df=section_df.rename(columns={"magasin_id":"store_id"})

In [ ]:
tous_clients = section_df["store_id"]
clients_commandes = store_df[""]

# Extraire les clients qui n'ont PAS commandé
clients_sans_achat = tous_clients[~tous_clients.isin(clients_commandes)]

In [25]:
len(section_df)

540

In [42]:
from sqlalchemy import create_engine
engine = create_engine(
    'postgresql+psycopg2://postgres:Admin@localhost:5432/analify'
)

In [48]:
rang_df.to_sql(
    "rang",          # nom de la table PostgreSQL
    engine,
    if_exists="append", # append → ajoute les lignes à la table
    index=False        # ne pas écrire l'index de pandas comme colonne
)

9

In [49]:
face_df.to_sql(
    "face",          # nom de la table PostgreSQL
    engine,
    if_exists="append", # append → ajoute les lignes à la table
    index=False        # ne pas écrire l'index de pandas comme colonne
)

18

In [53]:
section_df.to_sql(
    "section",          # nom de la table PostgreSQL
    engine,
    if_exists="append", # append → ajoute les lignes à la table
    index=False        # ne pas écrire l'index de pandas comme colonne
)

360

In [ ]:
df1['colonne_vide'] = np.random.choice(df2['source'], size=len(df1), replace=True)